askn37/multix-zinnia-sdk-modernAVR/boards.txt
AVRDU.bootloader.BODCFG=0b{bootloader.bod_lvl}{bootloader.bod_sample}{bootloader.bod_mode}00
AVRDU.bootloader.BOOTSIZE=0x01
AVRDU.bootloader.CODESIZE=0x00
AVRDU.bootloader.OSCCFG=0b00000000
AVRDU.bootloader.SYSCFG0=0b111{bootloader.updi_bit}{bootloader.reset_bit}{bootloader.browsave_bit}{bootloader.eesave_bit}
AVRDU.bootloader.SYSCFG1=0b000{bootloader.usbsink_bit}000
AVRDU.bootloader.WDTCFG=0b00000000
AVRDU.bootloader.bod_lvl=000
AVRDU.bootloader.bod_mode=00
AVRDU.bootloader.bod_sample=0
AVRDU.bootloader.tool=avrdude
AVRDU.bootloader.eepupload=
AVRDU.bootloader.eesave_bit=1
AVRDU.bootloader.browsave_bit=0
AVRDU.bootloader.usbsink_bit=01
AVRDU.bootloader.reset_bit=10
AVRDU.bootloader.updi_bit=1
AVRDU.bootloader.programed_type=.with_bootloader
AVRDU.build.export_merged_output=true
AVRDU.build.text_section_start=.text=0x200
AVRDU.build.buildopt=-DNDEBUG
AVRDU.build.console_baud=-DCONSOLE_BAUD=9600
AVRDU.build.led_pin=-DLED_BUILTIN=PIN_PA7
AVRDU.build.macroapi=-DENABLE_MACRO_API
AVRDU.build.printf=
AVRDU.build.printflt=
AVRDU.upload.protocol=arduino
AVRDU.upload.speed=115200
AVRDU.upload.tool=avrdude
AVRDU.menu.01_variant.22_AVR64DU32.build.board=AVR_AVR64DU32
AVRDU.menu.01_variant.22_AVR64DU32.build.mcu=avr64du32
AVRDU.menu.01_variant.22_AVR64DU32.build.variant=avr_du32
AVRDU.menu.01_variant.22_AVR64DU32.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega2_p512.x
AVRDU.menu.01_variant.22_AVR64DU32.upload.maximum_data_size=8192
AVRDU.menu.01_variant.22_AVR64DU32.upload.maximum_size=65024
AVRDU.menu.01_variant.22_AVR64DU32=32pin AVR64DU32 (64KiB+8KiB)
AVRDU.menu.01_variant.30=-
AVRDU.menu.01_variant.32_AVR64DU28.build.board=AVR_AVR64DU28
AVRDU.menu.01_variant.32_AVR64DU28.build.mcu=avr64du28
AVRDU.menu.01_variant.32_AVR64DU28.build.variant=avr_du28
AVRDU.menu.01_variant.32_AVR64DU28.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega2_p512.x
AVRDU.menu.01_variant.32_AVR64DU28.upload.maximum_data_size=8192
AVRDU.menu.01_variant.32_AVR64DU28.upload.maximum_size=65024
AVRDU.menu.01_variant.32_AVR64DU28=28pin AVR64DU28 (64KiB+8KiB)
AVRDU.menu.02_clock.01_32MHz.bootloader.bod_sample=0
AVRDU.menu.02_clock.01_32MHz.build.f_cpu=32000000L
AVRDU.menu.02_clock.01_32MHz=Internal 32 MHz (default)
AVRDU.menu.02_clock.02_16MHz.bootloader.bod_sample=0
AVRDU.menu.02_clock.02_16MHz.build.f_cpu=16000000L
AVRDU.menu.02_clock.02_16MHz=Internal 16 MHz
AVRDU.menu.02_clock.03_8MHz.bootloader.bod_sample=0
AVRDU.menu.02_clock.03_8MHz.build.f_cpu=8000000L
AVRDU.menu.02_clock.03_8MHz=Internal 8 MHz
AVRDU.menu.02_clock.04_4MHz.bootloader.bod_sample=0
AVRDU.menu.02_clock.04_4MHz.build.f_cpu=4000000L
AVRDU.menu.02_clock.04_4MHz=Internal 4 MHz
AVRDU.menu.02_clock.05_2MHz.bootloader.bod_sample=0
AVRDU.menu.02_clock.05_2MHz.build.f_cpu=2000000L
AVRDU.menu.02_clock.05_2MHz=Internal 2 MHz
AVRDU.menu.02_clock.06_1MHz.bootloader.bod_sample=0
AVRDU.menu.02_clock.06_1MHz.build.f_cpu=1000000L
AVRDU.menu.02_clock.06_1MHz=Internal 1 MHz
AVRDU.menu.02_clock.10=-
AVRDU.menu.02_clock.11_28MHz.bootloader.bod_sample=0
AVRDU.menu.02_clock.11_28MHz.build.f_cpu=28000000L
AVRDU.menu.02_clock.11_28MHz=Internal 28 MHz
AVRDU.menu.02_clock.12_14MHz.bootloader.bod_sample=0
AVRDU.menu.02_clock.12_14MHz.build.f_cpu=14000000L
AVRDU.menu.02_clock.12_14MHz=Internal 14 MHz
AVRDU.menu.02_clock.13_7MHz.bootloader.bod_sample=0
AVRDU.menu.02_clock.13_7MHz.build.f_cpu=7000000L
AVRDU.menu.02_clock.13_7MHz=Internal 7 MHz
AVRDU.menu.02_clock.20=-
AVRDU.menu.02_clock.21_24MHz.bootloader.bod_sample=0
AVRDU.menu.02_clock.21_24MHz.build.f_cpu=24000000L
AVRDU.menu.02_clock.21_24MHz=Internal 24 MHz
AVRDU.menu.02_clock.22_12MHz.bootloader.bod_sample=0
AVRDU.menu.02_clock.22_12MHz.build.f_cpu=12000000L
AVRDU.menu.02_clock.22_12MHz=Internal 12 MHz
AVRDU.menu.02_clock.23_6MHz.bootloader.bod_sample=0
AVRDU.menu.02_clock.23_6MHz.build.f_cpu=6000000L
AVRDU.menu.02_clock.23_6MHz=Internal 6 MHz
AVRDU.menu.02_clock.24_3MHz.bootloader.bod_sample=0
AVRDU.menu.02_clock.24_3MHz.build.f_cpu=3000000L
AVRDU.menu.02_clock.24_3MHz=Internal 3 MHz
AVRDU.menu.02_clock.30=-
AVRDU.menu.02_clock.31_20MHz.bootloader.bod_sample=0
AVRDU.menu.02_clock.31_20MHz.build.f_cpu=20000000L
AVRDU.menu.02_clock.31_20MHz=Internal 20 MHz
AVRDU.menu.02_clock.32_10MHz.bootloader.bod_sample=0
AVRDU.menu.02_clock.32_10MHz.build.f_cpu=10000000L
AVRDU.menu.02_clock.32_10MHz=Internal 10 MHz
AVRDU.menu.02_clock.33_5MHz.bootloader.bod_sample=0
AVRDU.menu.02_clock.33_5MHz.build.f_cpu=5000000L
AVRDU.menu.02_clock.33_5MHz=Internal 5 MHz
AVRDU.menu.02_clock.40=-
AVRDU.menu.02_clock.41_32768Hz.bootloader.bod_sample=1
AVRDU.menu.02_clock.41_32768Hz.build.f_cpu=32256
AVRDU.menu.02_clock.41_32768Hz=Internal 32.768 kHz (ULP)
AVRDU.menu.11_BODMODE.01_disabled.bootloader.bod_mode=00
AVRDU.menu.11_BODMODE.01_disabled=BOD Disabled
AVRDU.menu.11_BODMODE.02_enabled.bootloader.bod_mode=01
AVRDU.menu.11_BODMODE.02_enabled=BOD Enabled
AVRDU.menu.11_BODMODE.03_sampled.bootloader.bod_mode=10
AVRDU.menu.11_BODMODE.03_sampled=BOD Sampled
AVRDU.menu.11_BODMODE.04_enablewait.bootloader.bod_mode=11
AVRDU.menu.11_BODMODE.04_enablewait=BOD Enabled hold wakeup
AVRDU.menu.12_BODLVL.BODLEVEL0.bootloader.bod_lvl=000
AVRDU.menu.12_BODLVL.BODLEVEL0=Level 1.9V (default)
AVRDU.menu.12_BODLVL.BODLEVEL1.bootloader.bod_lvl=001
AVRDU.menu.12_BODLVL.BODLEVEL1=Level 2.45V
AVRDU.menu.12_BODLVL.BODLEVEL2.bootloader.bod_lvl=010
AVRDU.menu.12_BODLVL.BODLEVEL2=Level 2.7V
AVRDU.menu.12_BODLVL.BODLEVEL3.bootloader.bod_lvl=011
AVRDU.menu.12_BODLVL.BODLEVEL3=Level 2.85V
AVRDU.menu.21_resetpin.01_reset.bootloader.reset_bit=10
AVRDU.menu.21_resetpin.01_reset=PF6 pin=Reset
AVRDU.menu.21_resetpin.02_gpio.bootloader.reset_bit=00
AVRDU.menu.21_resetpin.02_gpio=PF6 pin=GPIO (input only)
AVRDU.menu.22_updipin.01_updi.bootloader.updi_bit=1
AVRDU.menu.22_updipin.01_updi=PF7 pin=UPDI (default)
AVRDU.menu.22_updipin.02_gpio.bootloader.updi_bit=0
AVRDU.menu.22_updipin.02_gpio=PF7 pin=GPIO (DANGER:NOT RECOMMENDED)
AVRDU.menu.23_eeprom.01_keep.bootloader.eesave_bit=1
AVRDU.menu.23_eeprom.01_keep=Save guard "Retained"
AVRDU.menu.23_eeprom.02_erase.bootloader.eesave_bit=0
AVRDU.menu.23_eeprom.02_erase=Save guard "Erase"
AVRDU.menu.23_eeprom.03_replace.bootloader.eepupload={bootloader.eeprom}
AVRDU.menu.23_eeprom.03_replace.bootloader.eesave_bit=1
AVRDU.menu.23_eeprom.03_replace="Erase" and "Replace"
AVRDU.menu.25_bootrow.01_erase.bootloader.browsave_bit=0
AVRDU.menu.25_bootrow.01_erase=Save guard "Erase"
AVRDU.menu.25_bootrow.02_keep.bootloader.browsave_bit=1
AVRDU.menu.25_bootrow.02_keep=Save guard "Retained"
AVRDU.menu.26_usbsinkcfg.01_enable.bootloader.usbsink_bit=01
AVRDU.menu.26_usbsinkcfg.01_enable=USBSINK "Enable" (default)
AVRDU.menu.26_usbsinkcfg.02_disable.bootloader.usbsink_bit=00
AVRDU.menu.26_usbsinkcfg.02_disable=USBSINK "Disable"
AVRDU.menu.51_buildopt.01_Release=Build Release (default)
AVRDU.menu.51_buildopt.02_Debug1.build.buildopt=-DDEBUG=1
AVRDU.menu.51_buildopt.02_Debug1=Build DEBUG=1
AVRDU.menu.51_buildopt.03_Debug2.build.buildopt=-DDEBUG=2
AVRDU.menu.51_buildopt.03_Debug2=Build DEBUG=2
AVRDU.menu.52_macroapi.01_Enable=Macro API Enable (default)
AVRDU.menu.52_macroapi.02_Disable.build.macroapi=
AVRDU.menu.52_macroapi.02_Disable=Macro API Disable
AVRDU.menu.52_macroapi.03_AllDisable.build.macroapi=
AVRDU.menu.52_macroapi.03_AllDisable.compiler.ldflags=-nostartfiles -nostdlib
AVRDU.menu.52_macroapi.03_AllDisable=Standard Library All Disable
AVRDU.menu.53_printf.01_default=default
AVRDU.menu.53_printf.02_full.build.printf=-DUSE_PRINTF_FLT
AVRDU.menu.53_printf.02_full.build.printflt=-Wl,-u,vfprintf -lprintf_flt
AVRDU.menu.53_printf.02_full=Float Support
AVRDU.menu.90_console_baud.01_9600bps.build.console_baud=-DCONSOLE_BAUD=9600
AVRDU.menu.90_console_baud.01_9600bps=CONSOLE_BAUD=9600 bps (default)
AVRDU.menu.90_console_baud.03_38400bps.build.console_baud=-DCONSOLE_BAUD=38400
AVRDU.menu.90_console_baud.03_38400bps=CONSOLE_BAUD=38400 bps
AVRDU.menu.90_console_baud.04_57600bps.build.console_baud=-DCONSOLE_BAUD=57600
AVRDU.menu.90_console_baud.04_57600bps=CONSOLE_BAUD=57600 bps
AVRDU.menu.90_console_baud.05_115200bps.build.console_baud=-DCONSOLE_BAUD=115200
AVRDU.menu.90_console_baud.05_115200bps=CONSOLE_BAUD=115200 bps
AVRDU.menu.90_console_baud.06_230400bps.build.console_baud=-DCONSOLE_BAUD=230400
AVRDU.menu.90_console_baud.06_230400bps=CONSOLE_BAUD=230400 bps
AVRDU.menu.90_console_baud.15_1000000bps.build.console_baud=-DCONSOLE_BAUD=1000000
AVRDU.menu.90_console_baud.15_1000000bps=CONSOLE_BAUD=1000000 bps
AVRDU.menu.90_console_baud.20=-
AVRDU.menu.90_console_baud.21_2400bps.build.console_baud=-DCONSOLE_BAUD=2400
AVRDU.menu.90_console_baud.21_2400bps=CONSOLE_BAUD=2400 bps (for ULP)
AVRDU.menu.95_bootloader.01_UART0_A0_LA7.bootloader.file=hex/boot_avrdu_UART0_A0_{upload.speed}_LA7.hex
AVRDU.menu.95_bootloader.01_UART0_A0_LA7.build.console_select=-DSerial=Serial0A
AVRDU.menu.95_bootloader.01_UART0_A0_LA7=UART0 TX:PA0 RX:PA1 LED=PA7 (default)


