askn37/multix-zinnia-sdk-modernAVR/boards.txt
AVRDB_noloader.bootloader.BODCFG=0b{bootloader.bod_lvl}{bootloader.bod_sample}{bootloader.bod_mode}00
AVRDB_noloader.bootloader.BOOTSIZE=0x00
AVRDB_noloader.bootloader.CODESIZE=0x00
AVRDB_noloader.bootloader.OSCCFG=0b00000000
AVRDB_noloader.bootloader.SYSCFG0=0b111{bootloader.updi_bit}{bootloader.reset_bit}0{bootloader.eesave_bit}
AVRDB_noloader.bootloader.SYSCFG1=0b000{bootloader.mvsys_bit}000
AVRDB_noloader.bootloader.WDTCFG=0b00000000
AVRDB_noloader.bootloader.bod_lvl=000
AVRDB_noloader.bootloader.bod_mode=00
AVRDB_noloader.bootloader.bod_sample=0
AVRDB_noloader.bootloader.eepupload=
AVRDB_noloader.bootloader.eesave_bit=1
AVRDB_noloader.bootloader.mvsys_bit=01
AVRDB_noloader.bootloader.reset_bit=10
AVRDB_noloader.bootloader.tool=avrdude
AVRDB_noloader.bootloader.updi_bit=1
AVRDB_noloader.bootloader.file=empty/empty.hex
AVRDB_noloader.bootloader.programed_type=
AVRDB_noloader.build.console_select=
AVRDB_noloader.build.export_merged_output=false
AVRDB_noloader.build.text_section_start=.text=0x0
AVRDB_noloader.build.buildopt=-DNDEBUG
AVRDB_noloader.build.console_baud=-DCONSOLE_BAUD=9600
AVRDB_noloader.build.led_pin=-DLED_BUILTIN=PIN_PA7
AVRDB_noloader.build.macroapi=-DENABLE_MACRO_API
AVRDB_noloader.build.printf=
AVRDB_noloader.build.printflt=
AVRDB_noloader.upload.speed=115200
AVRDB_noloader.upload.tool=
AVRDB_noloader.menu.01_variant.01_AVR128DB64.build.board=AVR_AVR128DB64
AVRDB_noloader.menu.01_variant.01_AVR128DB64.build.mcu=avr128db64
AVRDB_noloader.menu.01_variant.01_AVR128DB64.build.variant=avr_db64
AVRDB_noloader.menu.01_variant.01_AVR128DB64.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega4_p512.x
AVRDB_noloader.menu.01_variant.01_AVR128DB64.upload.maximum_data_size=16384
AVRDB_noloader.menu.01_variant.01_AVR128DB64.upload.maximum_size=131072
AVRDB_noloader.menu.01_variant.01_AVR128DB64=64pin AVR128DB64 (128KiB+16KiB)
AVRDB_noloader.menu.01_variant.02_AVR64DB64.build.board=AVR_AVR64DB64
AVRDB_noloader.menu.01_variant.02_AVR64DB64.build.mcu=avr64db64
AVRDB_noloader.menu.01_variant.02_AVR64DB64.build.variant=avr_db64
AVRDB_noloader.menu.01_variant.02_AVR64DB64.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega2_p512.x
AVRDB_noloader.menu.01_variant.02_AVR64DB64.upload.maximum_data_size=8192
AVRDB_noloader.menu.01_variant.02_AVR64DB64.upload.maximum_size=65536
AVRDB_noloader.menu.01_variant.02_AVR64DB64=64pin AVR64DB64 (64KiB+8KiB)
AVRDB_noloader.menu.01_variant.10=-
AVRDB_noloader.menu.01_variant.11_AVR128DB48.build.board=AVR_AVR128DB48
AVRDB_noloader.menu.01_variant.11_AVR128DB48.build.mcu=avr128db48
AVRDB_noloader.menu.01_variant.11_AVR128DB48.build.variant=avr_db48
AVRDB_noloader.menu.01_variant.11_AVR128DB48.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega4_p512.x
AVRDB_noloader.menu.01_variant.11_AVR128DB48.upload.maximum_data_size=16384
AVRDB_noloader.menu.01_variant.11_AVR128DB48.upload.maximum_size=131072
AVRDB_noloader.menu.01_variant.11_AVR128DB48=48pin AVR128DB48 (128KiB+16KiB)
AVRDB_noloader.menu.01_variant.12_AVR64DB48.build.board=AVR_AVR64DB48
AVRDB_noloader.menu.01_variant.12_AVR64DB48.build.mcu=avr64db48
AVRDB_noloader.menu.01_variant.12_AVR64DB48.build.variant=avr_db48
AVRDB_noloader.menu.01_variant.12_AVR64DB48.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega2_p512.x
AVRDB_noloader.menu.01_variant.12_AVR64DB48.upload.maximum_data_size=8192
AVRDB_noloader.menu.01_variant.12_AVR64DB48.upload.maximum_size=65536
AVRDB_noloader.menu.01_variant.12_AVR64DB48=48pin AVR64DB48 (64KiB+8KiB)
AVRDB_noloader.menu.01_variant.13_AVR32DB48.build.board=AVR_AVR32DB48
AVRDB_noloader.menu.01_variant.13_AVR32DB48.build.mcu=avr32db48
AVRDB_noloader.menu.01_variant.13_AVR32DB48.build.variant=avr_db48
AVRDB_noloader.menu.01_variant.13_AVR32DB48.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3_p512.x
AVRDB_noloader.menu.01_variant.13_AVR32DB48.upload.maximum_data_size=4096
AVRDB_noloader.menu.01_variant.13_AVR32DB48.upload.maximum_size=32768
AVRDB_noloader.menu.01_variant.13_AVR32DB48=48pin AVR32DB48 (32KiB+4KiB)
AVRDB_noloader.menu.01_variant.20=-
AVRDB_noloader.menu.01_variant.21_AVR128DB32.build.board=AVR_AVR128DB32
AVRDB_noloader.menu.01_variant.21_AVR128DB32.build.mcu=avr128db32
AVRDB_noloader.menu.01_variant.21_AVR128DB32.build.variant=avr_db32
AVRDB_noloader.menu.01_variant.21_AVR128DB32.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega4_p512.x
AVRDB_noloader.menu.01_variant.21_AVR128DB32.upload.maximum_data_size=16384
AVRDB_noloader.menu.01_variant.21_AVR128DB32.upload.maximum_size=131072
AVRDB_noloader.menu.01_variant.21_AVR128DB32=32pin AVR128DB32 (128KiB+16KiB)
AVRDB_noloader.menu.01_variant.22_AVR64DB32.build.board=AVR_AVR64DB32
AVRDB_noloader.menu.01_variant.22_AVR64DB32.build.mcu=avr64db32
AVRDB_noloader.menu.01_variant.22_AVR64DB32.build.variant=avr_db32
AVRDB_noloader.menu.01_variant.22_AVR64DB32.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega2_p512.x
AVRDB_noloader.menu.01_variant.22_AVR64DB32.upload.maximum_data_size=8192
AVRDB_noloader.menu.01_variant.22_AVR64DB32.upload.maximum_size=65536
AVRDB_noloader.menu.01_variant.22_AVR64DB32=32pin AVR64DB32 (64KiB+8KiB)
AVRDB_noloader.menu.01_variant.23_AVR32DB32.build.board=AVR_AVR32DB32
AVRDB_noloader.menu.01_variant.23_AVR32DB32.build.mcu=avr32db32
AVRDB_noloader.menu.01_variant.23_AVR32DB32.build.variant=avr_db32
AVRDB_noloader.menu.01_variant.23_AVR32DB32.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3_p512.x
AVRDB_noloader.menu.01_variant.23_AVR32DB32.upload.maximum_data_size=4096
AVRDB_noloader.menu.01_variant.23_AVR32DB32.upload.maximum_size=32768
AVRDB_noloader.menu.01_variant.23_AVR32DB32=32pin AVR32DB32 (32KiB+4KiB)
AVRDB_noloader.menu.01_variant.30=-
AVRDB_noloader.menu.01_variant.31_AVR128DB28.build.board=AVR_AVR128DB28
AVRDB_noloader.menu.01_variant.31_AVR128DB28.build.mcu=avr128db28
AVRDB_noloader.menu.01_variant.31_AVR128DB28.build.variant=avr_db28
AVRDB_noloader.menu.01_variant.31_AVR128DB28.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega4_p512.x
AVRDB_noloader.menu.01_variant.31_AVR128DB28.upload.maximum_data_size=16384
AVRDB_noloader.menu.01_variant.31_AVR128DB28.upload.maximum_size=131072
AVRDB_noloader.menu.01_variant.31_AVR128DB28=28pin AVR128DB28 (128KiB+16KiB)
AVRDB_noloader.menu.01_variant.32_AVR64DB28.build.board=AVR_AVR64DB28
AVRDB_noloader.menu.01_variant.32_AVR64DB28.build.mcu=avr64db28
AVRDB_noloader.menu.01_variant.32_AVR64DB28.build.variant=avr_db28
AVRDB_noloader.menu.01_variant.32_AVR64DB28.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega2_p512.x
AVRDB_noloader.menu.01_variant.32_AVR64DB28.upload.maximum_data_size=8192
AVRDB_noloader.menu.01_variant.32_AVR64DB28.upload.maximum_size=65536
AVRDB_noloader.menu.01_variant.32_AVR64DB28=28pin AVR64DB28 (64KiB+8KiB)
AVRDB_noloader.menu.01_variant.33_AVR32DB28.build.board=AVR_AVR32DB28
AVRDB_noloader.menu.01_variant.33_AVR32DB28.build.mcu=avr32db28
AVRDB_noloader.menu.01_variant.33_AVR32DB28.build.variant=avr_db28
AVRDB_noloader.menu.01_variant.33_AVR32DB28.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3_p512.x
AVRDB_noloader.menu.01_variant.33_AVR32DB28.upload.maximum_data_size=4096
AVRDB_noloader.menu.01_variant.33_AVR32DB28.upload.maximum_size=32768
AVRDB_noloader.menu.01_variant.33_AVR32DB28=28pin AVR32DB28 (32KiB+4KiB)
AVRDB_noloader.menu.02_clock.01_24MHz.bootloader.bod_sample=0
AVRDB_noloader.menu.02_clock.01_24MHz.build.f_cpu=24000000L
AVRDB_noloader.menu.02_clock.01_24MHz=Internal 24 MHz (default)
AVRDB_noloader.menu.02_clock.01_12MHz.bootloader.bod_sample=0
AVRDB_noloader.menu.02_clock.01_12MHz.build.f_cpu=12000000L
AVRDB_noloader.menu.02_clock.01_12MHz=Internal 12 MHz
AVRDB_noloader.menu.02_clock.03_6MHz.bootloader.bod_sample=0
AVRDB_noloader.menu.02_clock.03_6MHz.build.f_cpu=6000000L
AVRDB_noloader.menu.02_clock.03_6MHz=Internal 6 MHz
AVRDB_noloader.menu.02_clock.04_3MHz.bootloader.bod_sample=0
AVRDB_noloader.menu.02_clock.04_3MHz.build.f_cpu=3000000L
AVRDB_noloader.menu.02_clock.04_3MHz=Internal 3 MHz
AVRDB_noloader.menu.02_clock.10=-
AVRDB_noloader.menu.02_clock.11_20MHz.bootloader.bod_sample=0
AVRDB_noloader.menu.02_clock.11_20MHz.build.f_cpu=20000000L
AVRDB_noloader.menu.02_clock.11_20MHz=Internal 20 MHz
AVRDB_noloader.menu.02_clock.12_10MHz.bootloader.bod_sample=0
AVRDB_noloader.menu.02_clock.12_10MHz.build.f_cpu=10000000L
AVRDB_noloader.menu.02_clock.12_10MHz=Internal 10 MHz
AVRDB_noloader.menu.02_clock.13_5MHz.bootloader.bod_sample=0
AVRDB_noloader.menu.02_clock.13_5MHz.build.f_cpu=5000000L
AVRDB_noloader.menu.02_clock.13_5MHz=Internal 5 MHz
AVRDB_noloader.menu.02_clock.20=-
AVRDB_noloader.menu.02_clock.21_16MHz.bootloader.bod_sample=0
AVRDB_noloader.menu.02_clock.21_16MHz.build.f_cpu=16000000L
AVRDB_noloader.menu.02_clock.21_16MHz=Internal 16 MHz
AVRDB_noloader.menu.02_clock.22_8MHz.bootloader.bod_sample=0
AVRDB_noloader.menu.02_clock.22_8MHz.build.f_cpu=8000000L
AVRDB_noloader.menu.02_clock.22_8MHz=Internal 8 MHz
AVRDB_noloader.menu.02_clock.23_4MHz.bootloader.bod_sample=0
AVRDB_noloader.menu.02_clock.23_4MHz.build.f_cpu=4000000L
AVRDB_noloader.menu.02_clock.23_4MHz=Internal 4 MHz
AVRDB_noloader.menu.02_clock.24_2MHz.bootloader.bod_sample=0
AVRDB_noloader.menu.02_clock.24_2MHz.build.f_cpu=2000000L
AVRDB_noloader.menu.02_clock.24_2MHz=Internal 2 MHz
AVRDB_noloader.menu.02_clock.25_1MHz.bootloader.bod_sample=0
AVRDB_noloader.menu.02_clock.25_1MHz.build.f_cpu=1000000L
AVRDB_noloader.menu.02_clock.25_1MHz=Internal 1 MHz
AVRDB_noloader.menu.02_clock.30=-
AVRDB_noloader.menu.02_clock.31_32MHz.bootloader.bod_sample=0
AVRDB_noloader.menu.02_clock.31_32MHz.build.f_cpu=32000000L
AVRDB_noloader.menu.02_clock.31_32MHz=Internal 32 MHz (OVERCLOCK)
AVRDB_noloader.menu.02_clock.32_28MHz.bootloader.bod_sample=0
AVRDB_noloader.menu.02_clock.32_28MHz.build.f_cpu=28000000L
AVRDB_noloader.menu.02_clock.32_28MHz=Internal 28 MHz (OVERCLOCK)
AVRDB_noloader.menu.02_clock.33_14MHz.bootloader.bod_sample=0
AVRDB_noloader.menu.02_clock.33_14MHz.build.f_cpu=14000000L
AVRDB_noloader.menu.02_clock.33_14MHz=Internal 14 MHz (OVERCLOCK)
AVRDB_noloader.menu.02_clock.34_7MHz.bootloader.bod_sample=0
AVRDB_noloader.menu.02_clock.34_7MHz.build.f_cpu=7000000L
AVRDB_noloader.menu.02_clock.34_7MHz=Internal 7 MHz (OVERCLOCK)
AVRDB_noloader.menu.02_clock.40=-
AVRDB_noloader.menu.02_clock.41_32768Hz.bootloader.bod_sample=1
AVRDB_noloader.menu.02_clock.41_32768Hz.build.f_cpu=32768
AVRDB_noloader.menu.02_clock.41_32768Hz=Internal 32.768 kHz (ULP)
AVRDB_noloader.menu.11_BODMODE.01_disabled.bootloader.bod_mode=00
AVRDB_noloader.menu.11_BODMODE.01_disabled=BOD Disabled
AVRDB_noloader.menu.11_BODMODE.02_enabled.bootloader.bod_mode=01
AVRDB_noloader.menu.11_BODMODE.02_enabled=BOD Enabled
AVRDB_noloader.menu.11_BODMODE.03_sampled.bootloader.bod_mode=10
AVRDB_noloader.menu.11_BODMODE.03_sampled=BOD Sampled
AVRDB_noloader.menu.11_BODMODE.04_enablewait.bootloader.bod_mode=11
AVRDB_noloader.menu.11_BODMODE.04_enablewait=BOD Enabled hold wakeup
AVRDB_noloader.menu.12_BODLVL.BODLEVEL0.bootloader.bod_lvl=000
AVRDB_noloader.menu.12_BODLVL.BODLEVEL0=Level 1.9V (default)
AVRDB_noloader.menu.12_BODLVL.BODLEVEL1.bootloader.bod_lvl=001
AVRDB_noloader.menu.12_BODLVL.BODLEVEL1=Level 2.45V
AVRDB_noloader.menu.12_BODLVL.BODLEVEL2.bootloader.bod_lvl=010
AVRDB_noloader.menu.12_BODLVL.BODLEVEL2=Level 2.7V
AVRDB_noloader.menu.12_BODLVL.BODLEVEL3.bootloader.bod_lvl=011
AVRDB_noloader.menu.12_BODLVL.BODLEVEL3=Level 2.85V
AVRDB_noloader.menu.21_resetpin.01_reset.bootloader.reset_bit=10
AVRDB_noloader.menu.21_resetpin.01_reset=PF6 pin=Reset
AVRDB_noloader.menu.21_resetpin.02_gpio.bootloader.reset_bit=00
AVRDB_noloader.menu.21_resetpin.02_gpio=PF6 pin=GPIO (input only)
AVRDB_noloader.menu.23_eeprom.01_keep.bootloader.eesave_bit=1
AVRDB_noloader.menu.23_eeprom.01_keep=Save guard "Retained"
AVRDB_noloader.menu.23_eeprom.02_erase.bootloader.eesave_bit=0
AVRDB_noloader.menu.23_eeprom.02_erase=Save guard "Erase"
AVRDB_noloader.menu.23_eeprom.03_replace.bootloader.eepupload={bootloader.eeprom}
AVRDB_noloader.menu.23_eeprom.03_replace.bootloader.eesave_bit=1
AVRDB_noloader.menu.23_eeprom.03_replace="Erase" and "Replace"
AVRDB_noloader.menu.24_mvsyscfg.01_dual.bootloader.mvsys_bit=01
AVRDB_noloader.menu.24_mvsyscfg.01_dual=MVIO "Dual" (default)
AVRDB_noloader.menu.24_mvsyscfg.02_single.bootloader.mvsys_bit=10
AVRDB_noloader.menu.24_mvsyscfg.02_single=MVIO "Single"
AVRDB_noloader.menu.51_buildopt.01_Release=Build Release (default)
AVRDB_noloader.menu.51_buildopt.02_Debug1.build.buildopt=-DDEBUG=1
AVRDB_noloader.menu.51_buildopt.02_Debug1=Build DEBUG=1
AVRDB_noloader.menu.51_buildopt.03_Debug2.build.buildopt=-DDEBUG=2
AVRDB_noloader.menu.51_buildopt.03_Debug2=Build DEBUG=2
AVRDB_noloader.menu.52_macroapi.01_Enable=Macro API Enable (default)
AVRDB_noloader.menu.52_macroapi.02_Disable.build.macroapi=
AVRDB_noloader.menu.52_macroapi.02_Disable=Macro API Disable
AVRDB_noloader.menu.52_macroapi.03_AllDisable.build.macroapi=
AVRDB_noloader.menu.52_macroapi.03_AllDisable.compiler.ldflags=-nostartfiles -nostdlib
AVRDB_noloader.menu.52_macroapi.03_AllDisable=Standard Library All Disable
AVRDB_noloader.menu.53_printf.01_default=default
AVRDB_noloader.menu.53_printf.02_full.build.printf=-DUSE_PRINTF_FLT
AVRDB_noloader.menu.53_printf.02_full.build.printflt=-Wl,-u,vfprintf -lprintf_flt
AVRDB_noloader.menu.53_printf.02_full=Float Support
AVRDB_noloader.menu.54_console_select.01_UART0_A0_LA7.build.console_select=-DSerial=Serial0A
AVRDB_noloader.menu.54_console_select.01_UART0_A0_LA7.build.led_pin=-DLED_BUILTIN=PIN_PA7
AVRDB_noloader.menu.54_console_select.01_UART0_A0_LA7=UART0 TX:PA0 RX:PA1 LED=PA7
AVRDB_noloader.menu.54_console_select.02_UART1_C0_LA7.build.console_select=-DSerial=Serial1A
AVRDB_noloader.menu.54_console_select.02_UART1_C0_LA7.build.led_pin=-DLED_BUILTIN=PIN_PA7
AVRDB_noloader.menu.54_console_select.02_UART1_C0_LA7=UART1 TX:PC0 RX:PC1 LED=PA7
AVRDB_noloader.menu.54_console_select.03_UART2_F0_LA7.build.console_select=-DSerial=Serial2A
AVRDB_noloader.menu.54_console_select.03_UART2_F0_LA7.build.led_pin=-DLED_BUILTIN=PIN_PA7
AVRDB_noloader.menu.54_console_select.03_UART2_F0_LA7=UART2 TX:PF0 RX:PF1 LED=PA7
AVRDB_noloader.menu.54_console_select.03_UART2_F4_LA7.build.console_select=-DSerial=Serial2B
AVRDB_noloader.menu.54_console_select.03_UART2_F4_LA7.build.led_pin=-DLED_BUILTIN=PIN_PA7
AVRDB_noloader.menu.54_console_select.03_UART2_F4_LA7=UART2 TX:PF4 RX:PF5 LED=PA7
AVRDB_noloader.menu.54_console_select.10=-
AVRDB_noloader.menu.54_console_select.11_UART1_B0_LB3_SB3_Curiosity.build.console_select=-DSerial=Serial3A
AVRDB_noloader.menu.54_console_select.11_UART1_B0_LB3_SB3_Curiosity.build.led_pin=-DLED_BUILTIN=PIN_PB3 -DSW_BUILTIN=PIN_PB2
AVRDB_noloader.menu.54_console_select.11_UART1_B0_LB3_SB3_Curiosity=UART3 TX:PB0 RX:PB1 LED=PB3 SW=PB2 (AVR128DB48 Curiosity Nano)
AVRDB_noloader.menu.90_console_baud.01_9600bps.build.console_baud=-DCONSOLE_BAUD=9600
AVRDB_noloader.menu.90_console_baud.01_9600bps=CONSOLE_BAUD=9600 bps (default)
AVRDB_noloader.menu.90_console_baud.03_38400bps.build.console_baud=-DCONSOLE_BAUD=38400
AVRDB_noloader.menu.90_console_baud.03_38400bps=CONSOLE_BAUD=38400 bps
AVRDB_noloader.menu.90_console_baud.04_57600bps.build.console_baud=-DCONSOLE_BAUD=57600
AVRDB_noloader.menu.90_console_baud.04_57600bps=CONSOLE_BAUD=57600 bps
AVRDB_noloader.menu.90_console_baud.05_115200bps.build.console_baud=-DCONSOLE_BAUD=115200
AVRDB_noloader.menu.90_console_baud.05_115200bps=CONSOLE_BAUD=115200 bps
AVRDB_noloader.menu.90_console_baud.06_230400bps.build.console_baud=-DCONSOLE_BAUD=230400
AVRDB_noloader.menu.90_console_baud.06_230400bps=CONSOLE_BAUD=230400 bps
AVRDB_noloader.menu.90_console_baud.15_1000000bps.build.console_baud=-DCONSOLE_BAUD=1000000
AVRDB_noloader.menu.90_console_baud.15_1000000bps=CONSOLE_BAUD=1000000 bps
AVRDB_noloader.menu.90_console_baud.20=-
AVRDB_noloader.menu.90_console_baud.21_2400bps.build.console_baud=-DCONSOLE_BAUD=2400
AVRDB_noloader.menu.90_console_baud.21_2400bps=CONSOLE_BAUD=2400 bps (for ULP)
AVRDB_noloader.menu.95_bootloader.00_woBootloader=without Bootloader


